earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Degz Mizu (pico-debug)
# -----------------------------------
degz_mizupicodebug.name=Degz Mizu (pico-debug)
degz_mizupicodebug.vid.0=0x1209
degz_mizupicodebug.pid.0=0x2488
degz_mizupicodebug.vid.1=0x1209
degz_mizupicodebug.pid.1=0x2588
degz_mizupicodebug.vid.2=0x1209
degz_mizupicodebug.pid.2=0x6488
degz_mizupicodebug.vid.3=0x1209
degz_mizupicodebug.pid.3=0x6588
degz_mizupicodebug.vid.4=0x1209
degz_mizupicodebug.pid.4=0xa488
degz_mizupicodebug.vid.5=0x1209
degz_mizupicodebug.pid.5=0xa588
degz_mizupicodebug.vid.6=0x1209
degz_mizupicodebug.pid.6=0xe488
degz_mizupicodebug.vid.7=0x1209
degz_mizupicodebug.pid.7=0xe588
degz_mizupicodebug.build.usbpid=-DSERIALUSB_PID=0x000a
degz_mizupicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
degz_mizupicodebug.build.board=DEGZ_MIZU
degz_mizupicodebug.build.mcu=cortex-m0plus
degz_mizupicodebug.build.variant=degz_mizu
degz_mizupicodebug.upload.tool=picodebug
degz_mizupicodebug.upload.tool.default=picodebug
degz_mizupicodebug.upload.maximum_size=8388608
degz_mizupicodebug.upload.maximum_data_size=245760
degz_mizupicodebug.upload.wait_for_upload_port=true
degz_mizupicodebug.upload.erase_cmd=
degz_mizupicodebug.serial.disableDTR=false
degz_mizupicodebug.serial.disableRTS=false
degz_mizupicodebug.build.f_cpu=125000000
degz_mizupicodebug.build.led=
degz_mizupicodebug.build.core=rp2040
degz_mizupicodebug.build.ldscript=memmap_default.ld
degz_mizupicodebug.build.ram_length=240k
degz_mizupicodebug.build.debugscript=picodebug.tcl
degz_mizupicodebug.build.boot2=boot2_generic_03h_4_padded_checksum
degz_mizupicodebug.build.vid=0x2e8a
degz_mizupicodebug.build.pid=0x000a
degz_mizupicodebug.build.usb_manufacturer="Degz"
degz_mizupicodebug.build.usb_product="Mizu (pico-debug)"
degz_mizupicodebug.menu.flash.8388608_0=8MB (no FS)
degz_mizupicodebug.menu.flash.8388608_0.upload.maximum_size=8384512
degz_mizupicodebug.menu.flash.8388608_0.build.flash_length=8384512
degz_mizupicodebug.menu.flash.8388608_0.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_0.build.fs_start=276819968
degz_mizupicodebug.menu.flash.8388608_0.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
degz_mizupicodebug.menu.flash.8388608_65536.upload.maximum_size=8318976
degz_mizupicodebug.menu.flash.8388608_65536.build.flash_length=8318976
degz_mizupicodebug.menu.flash.8388608_65536.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_65536.build.fs_start=276754432
degz_mizupicodebug.menu.flash.8388608_65536.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
degz_mizupicodebug.menu.flash.8388608_131072.upload.maximum_size=8253440
degz_mizupicodebug.menu.flash.8388608_131072.build.flash_length=8253440
degz_mizupicodebug.menu.flash.8388608_131072.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_131072.build.fs_start=276688896
degz_mizupicodebug.menu.flash.8388608_131072.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
degz_mizupicodebug.menu.flash.8388608_262144.upload.maximum_size=8122368
degz_mizupicodebug.menu.flash.8388608_262144.build.flash_length=8122368
degz_mizupicodebug.menu.flash.8388608_262144.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_262144.build.fs_start=276557824
degz_mizupicodebug.menu.flash.8388608_262144.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
degz_mizupicodebug.menu.flash.8388608_524288.upload.maximum_size=7860224
degz_mizupicodebug.menu.flash.8388608_524288.build.flash_length=7860224
degz_mizupicodebug.menu.flash.8388608_524288.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_524288.build.fs_start=276295680
degz_mizupicodebug.menu.flash.8388608_524288.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
degz_mizupicodebug.menu.flash.8388608_1048576.upload.maximum_size=7335936
degz_mizupicodebug.menu.flash.8388608_1048576.build.flash_length=7335936
degz_mizupicodebug.menu.flash.8388608_1048576.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_1048576.build.fs_start=275771392
degz_mizupicodebug.menu.flash.8388608_1048576.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
degz_mizupicodebug.menu.flash.8388608_2097152.upload.maximum_size=6287360
degz_mizupicodebug.menu.flash.8388608_2097152.build.flash_length=6287360
degz_mizupicodebug.menu.flash.8388608_2097152.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_2097152.build.fs_start=274722816
degz_mizupicodebug.menu.flash.8388608_2097152.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
degz_mizupicodebug.menu.flash.8388608_3145728.upload.maximum_size=5238784
degz_mizupicodebug.menu.flash.8388608_3145728.build.flash_length=5238784
degz_mizupicodebug.menu.flash.8388608_3145728.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_3145728.build.fs_start=273674240
degz_mizupicodebug.menu.flash.8388608_3145728.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
degz_mizupicodebug.menu.flash.8388608_4194304.upload.maximum_size=4190208
degz_mizupicodebug.menu.flash.8388608_4194304.build.flash_length=4190208
degz_mizupicodebug.menu.flash.8388608_4194304.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_4194304.build.fs_start=272625664
degz_mizupicodebug.menu.flash.8388608_4194304.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
degz_mizupicodebug.menu.flash.8388608_5242880.upload.maximum_size=3141632
degz_mizupicodebug.menu.flash.8388608_5242880.build.flash_length=3141632
degz_mizupicodebug.menu.flash.8388608_5242880.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_5242880.build.fs_start=271577088
degz_mizupicodebug.menu.flash.8388608_5242880.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
degz_mizupicodebug.menu.flash.8388608_6291456.upload.maximum_size=2093056
degz_mizupicodebug.menu.flash.8388608_6291456.build.flash_length=2093056
degz_mizupicodebug.menu.flash.8388608_6291456.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_6291456.build.fs_start=270528512
degz_mizupicodebug.menu.flash.8388608_6291456.build.fs_end=276819968
degz_mizupicodebug.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
degz_mizupicodebug.menu.flash.8388608_7340032.upload.maximum_size=1044480
degz_mizupicodebug.menu.flash.8388608_7340032.build.flash_length=1044480
degz_mizupicodebug.menu.flash.8388608_7340032.build.eeprom_start=276819968
degz_mizupicodebug.menu.flash.8388608_7340032.build.fs_start=269479936
degz_mizupicodebug.menu.flash.8388608_7340032.build.fs_end=276819968
degz_mizupicodebug.menu.freq.133=133 MHz
degz_mizupicodebug.menu.freq.133.build.f_cpu=133000000L
degz_mizupicodebug.menu.freq.50=50 MHz
degz_mizupicodebug.menu.freq.50.build.f_cpu=50000000L
degz_mizupicodebug.menu.freq.100=100 MHz
degz_mizupicodebug.menu.freq.100.build.f_cpu=100000000L
degz_mizupicodebug.menu.freq.120=120 MHz
degz_mizupicodebug.menu.freq.120.build.f_cpu=120000000L
degz_mizupicodebug.menu.freq.125=125 MHz
degz_mizupicodebug.menu.freq.125.build.f_cpu=125000000L
degz_mizupicodebug.menu.freq.150=150 MHz (Overclock)
degz_mizupicodebug.menu.freq.150.build.f_cpu=150000000L
degz_mizupicodebug.menu.freq.175=175 MHz (Overclock)
degz_mizupicodebug.menu.freq.175.build.f_cpu=175000000L
degz_mizupicodebug.menu.freq.200=200 MHz (Overclock)
degz_mizupicodebug.menu.freq.200.build.f_cpu=200000000L
degz_mizupicodebug.menu.freq.225=225 MHz (Overclock)
degz_mizupicodebug.menu.freq.225.build.f_cpu=225000000L
degz_mizupicodebug.menu.freq.240=240 MHz (Overclock)
degz_mizupicodebug.menu.freq.240.build.f_cpu=240000000L
degz_mizupicodebug.menu.freq.250=250 MHz (Overclock)
degz_mizupicodebug.menu.freq.250.build.f_cpu=250000000L
degz_mizupicodebug.menu.freq.275=275 MHz (Overclock)
degz_mizupicodebug.menu.freq.275.build.f_cpu=275000000L
degz_mizupicodebug.menu.freq.300=300 MHz (Overclock)
degz_mizupicodebug.menu.freq.300.build.f_cpu=300000000L
degz_mizupicodebug.menu.opt.Small=Small (-Os) (standard)
degz_mizupicodebug.menu.opt.Small.build.flags.optimize=-Os
degz_mizupicodebug.menu.opt.Optimize=Optimize (-O)
degz_mizupicodebug.menu.opt.Optimize.build.flags.optimize=-O
degz_mizupicodebug.menu.opt.Optimize2=Optimize More (-O2)
degz_mizupicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
degz_mizupicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
degz_mizupicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
degz_mizupicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
degz_mizupicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
degz_mizupicodebug.menu.opt.Debug=Debug (-Og)
degz_mizupicodebug.menu.opt.Debug.build.flags.optimize=-Og
degz_mizupicodebug.menu.rtti.Disabled=Disabled
degz_mizupicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
degz_mizupicodebug.menu.rtti.Enabled=Enabled
degz_mizupicodebug.menu.rtti.Enabled.build.flags.rtti=
degz_mizupicodebug.menu.stackprotect.Disabled=Disabled
degz_mizupicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
degz_mizupicodebug.menu.stackprotect.Enabled=Enabled
degz_mizupicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
degz_mizupicodebug.menu.exceptions.Disabled=Disabled
degz_mizupicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
degz_mizupicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
degz_mizupicodebug.menu.exceptions.Enabled=Enabled
degz_mizupicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
degz_mizupicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
degz_mizupicodebug.menu.dbgport.Disabled=Disabled
degz_mizupicodebug.menu.dbgport.Disabled.build.debug_port=
degz_mizupicodebug.menu.dbgport.Serial=Serial
degz_mizupicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
degz_mizupicodebug.menu.dbgport.Serial1=Serial1
degz_mizupicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
degz_mizupicodebug.menu.dbgport.Serial2=Serial2
degz_mizupicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
degz_mizupicodebug.menu.dbglvl.None=None
degz_mizupicodebug.menu.dbglvl.None.build.debug_level=
degz_mizupicodebug.menu.dbglvl.Core=Core
degz_mizupicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
degz_mizupicodebug.menu.dbglvl.SPI=SPI
degz_mizupicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
degz_mizupicodebug.menu.dbglvl.Wire=Wire
degz_mizupicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
degz_mizupicodebug.menu.dbglvl.All=All
degz_mizupicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
degz_mizupicodebug.menu.dbglvl.NDEBUG=NDEBUG
degz_mizupicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
degz_mizupicodebug.menu.usbstack.nousb=No USB
degz_mizupicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
degz_mizupicodebug.menu.ipstack.ipv4only=IPv4 Only
degz_mizupicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
degz_mizupicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
degz_mizupicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
degz_mizupicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
degz_mizupicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

