earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# ExtremeElectronics RC2040 (pico-debug)
# -----------------------------------
extelec_rc2040picodebug.name=ExtremeElectronics RC2040 (pico-debug)
extelec_rc2040picodebug.vid.0=0x1209
extelec_rc2040picodebug.pid.0=0x2488
extelec_rc2040picodebug.vid.1=0x1209
extelec_rc2040picodebug.pid.1=0x2588
extelec_rc2040picodebug.vid.2=0x1209
extelec_rc2040picodebug.pid.2=0x6488
extelec_rc2040picodebug.vid.3=0x1209
extelec_rc2040picodebug.pid.3=0x6588
extelec_rc2040picodebug.vid.4=0x1209
extelec_rc2040picodebug.pid.4=0xa488
extelec_rc2040picodebug.vid.5=0x1209
extelec_rc2040picodebug.pid.5=0xa588
extelec_rc2040picodebug.vid.6=0x1209
extelec_rc2040picodebug.pid.6=0xe488
extelec_rc2040picodebug.vid.7=0x1209
extelec_rc2040picodebug.pid.7=0xe588
extelec_rc2040picodebug.build.usbpid=-DSERIALUSB_PID=0xee20
extelec_rc2040picodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
extelec_rc2040picodebug.build.board=EXTREMEELEXTRONICS_RC2040
extelec_rc2040picodebug.build.mcu=cortex-m0plus
extelec_rc2040picodebug.build.variant=extelec_rc2040
extelec_rc2040picodebug.upload.tool=picodebug
extelec_rc2040picodebug.upload.tool.default=picodebug
extelec_rc2040picodebug.upload.maximum_size=2097152
extelec_rc2040picodebug.upload.maximum_data_size=245760
extelec_rc2040picodebug.upload.wait_for_upload_port=true
extelec_rc2040picodebug.upload.erase_cmd=
extelec_rc2040picodebug.serial.disableDTR=false
extelec_rc2040picodebug.serial.disableRTS=false
extelec_rc2040picodebug.build.f_cpu=125000000
extelec_rc2040picodebug.build.led=
extelec_rc2040picodebug.build.core=rp2040
extelec_rc2040picodebug.build.ldscript=memmap_default.ld
extelec_rc2040picodebug.build.ram_length=240k
extelec_rc2040picodebug.build.debugscript=picodebug.tcl
extelec_rc2040picodebug.build.boot2=boot2_w25q080_2_padded_checksum
extelec_rc2040picodebug.build.vid=0x2e8a
extelec_rc2040picodebug.build.pid=0xee20
extelec_rc2040picodebug.build.usb_manufacturer="ExtremeElectronics"
extelec_rc2040picodebug.build.usb_product="RC2040 (pico-debug)"
extelec_rc2040picodebug.menu.flash.2097152_0=2MB (no FS)
extelec_rc2040picodebug.menu.flash.2097152_0.upload.maximum_size=2093056
extelec_rc2040picodebug.menu.flash.2097152_0.build.flash_length=2093056
extelec_rc2040picodebug.menu.flash.2097152_0.build.eeprom_start=270528512
extelec_rc2040picodebug.menu.flash.2097152_0.build.fs_start=270528512
extelec_rc2040picodebug.menu.flash.2097152_0.build.fs_end=270528512
extelec_rc2040picodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
extelec_rc2040picodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
extelec_rc2040picodebug.menu.flash.2097152_65536.build.flash_length=2027520
extelec_rc2040picodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
extelec_rc2040picodebug.menu.flash.2097152_65536.build.fs_start=270462976
extelec_rc2040picodebug.menu.flash.2097152_65536.build.fs_end=270528512
extelec_rc2040picodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
extelec_rc2040picodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
extelec_rc2040picodebug.menu.flash.2097152_131072.build.flash_length=1961984
extelec_rc2040picodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
extelec_rc2040picodebug.menu.flash.2097152_131072.build.fs_start=270397440
extelec_rc2040picodebug.menu.flash.2097152_131072.build.fs_end=270528512
extelec_rc2040picodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
extelec_rc2040picodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
extelec_rc2040picodebug.menu.flash.2097152_262144.build.flash_length=1830912
extelec_rc2040picodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
extelec_rc2040picodebug.menu.flash.2097152_262144.build.fs_start=270266368
extelec_rc2040picodebug.menu.flash.2097152_262144.build.fs_end=270528512
extelec_rc2040picodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
extelec_rc2040picodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
extelec_rc2040picodebug.menu.flash.2097152_524288.build.flash_length=1568768
extelec_rc2040picodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
extelec_rc2040picodebug.menu.flash.2097152_524288.build.fs_start=270004224
extelec_rc2040picodebug.menu.flash.2097152_524288.build.fs_end=270528512
extelec_rc2040picodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
extelec_rc2040picodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
extelec_rc2040picodebug.menu.flash.2097152_1048576.build.flash_length=1044480
extelec_rc2040picodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
extelec_rc2040picodebug.menu.flash.2097152_1048576.build.fs_start=269479936
extelec_rc2040picodebug.menu.flash.2097152_1048576.build.fs_end=270528512
extelec_rc2040picodebug.menu.freq.133=133 MHz
extelec_rc2040picodebug.menu.freq.133.build.f_cpu=133000000L
extelec_rc2040picodebug.menu.freq.50=50 MHz
extelec_rc2040picodebug.menu.freq.50.build.f_cpu=50000000L
extelec_rc2040picodebug.menu.freq.100=100 MHz
extelec_rc2040picodebug.menu.freq.100.build.f_cpu=100000000L
extelec_rc2040picodebug.menu.freq.120=120 MHz
extelec_rc2040picodebug.menu.freq.120.build.f_cpu=120000000L
extelec_rc2040picodebug.menu.freq.125=125 MHz
extelec_rc2040picodebug.menu.freq.125.build.f_cpu=125000000L
extelec_rc2040picodebug.menu.freq.150=150 MHz (Overclock)
extelec_rc2040picodebug.menu.freq.150.build.f_cpu=150000000L
extelec_rc2040picodebug.menu.freq.175=175 MHz (Overclock)
extelec_rc2040picodebug.menu.freq.175.build.f_cpu=175000000L
extelec_rc2040picodebug.menu.freq.200=200 MHz (Overclock)
extelec_rc2040picodebug.menu.freq.200.build.f_cpu=200000000L
extelec_rc2040picodebug.menu.freq.225=225 MHz (Overclock)
extelec_rc2040picodebug.menu.freq.225.build.f_cpu=225000000L
extelec_rc2040picodebug.menu.freq.240=240 MHz (Overclock)
extelec_rc2040picodebug.menu.freq.240.build.f_cpu=240000000L
extelec_rc2040picodebug.menu.freq.250=250 MHz (Overclock)
extelec_rc2040picodebug.menu.freq.250.build.f_cpu=250000000L
extelec_rc2040picodebug.menu.freq.275=275 MHz (Overclock)
extelec_rc2040picodebug.menu.freq.275.build.f_cpu=275000000L
extelec_rc2040picodebug.menu.freq.300=300 MHz (Overclock)
extelec_rc2040picodebug.menu.freq.300.build.f_cpu=300000000L
extelec_rc2040picodebug.menu.opt.Small=Small (-Os) (standard)
extelec_rc2040picodebug.menu.opt.Small.build.flags.optimize=-Os
extelec_rc2040picodebug.menu.opt.Optimize=Optimize (-O)
extelec_rc2040picodebug.menu.opt.Optimize.build.flags.optimize=-O
extelec_rc2040picodebug.menu.opt.Optimize2=Optimize More (-O2)
extelec_rc2040picodebug.menu.opt.Optimize2.build.flags.optimize=-O2
extelec_rc2040picodebug.menu.opt.Optimize3=Optimize Even More (-O3)
extelec_rc2040picodebug.menu.opt.Optimize3.build.flags.optimize=-O3
extelec_rc2040picodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
extelec_rc2040picodebug.menu.opt.Fast.build.flags.optimize=-Ofast
extelec_rc2040picodebug.menu.opt.Debug=Debug (-Og)
extelec_rc2040picodebug.menu.opt.Debug.build.flags.optimize=-Og
extelec_rc2040picodebug.menu.rtti.Disabled=Disabled
extelec_rc2040picodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
extelec_rc2040picodebug.menu.rtti.Enabled=Enabled
extelec_rc2040picodebug.menu.rtti.Enabled.build.flags.rtti=
extelec_rc2040picodebug.menu.stackprotect.Disabled=Disabled
extelec_rc2040picodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
extelec_rc2040picodebug.menu.stackprotect.Enabled=Enabled
extelec_rc2040picodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
extelec_rc2040picodebug.menu.exceptions.Disabled=Disabled
extelec_rc2040picodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
extelec_rc2040picodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
extelec_rc2040picodebug.menu.exceptions.Enabled=Enabled
extelec_rc2040picodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
extelec_rc2040picodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
extelec_rc2040picodebug.menu.dbgport.Disabled=Disabled
extelec_rc2040picodebug.menu.dbgport.Disabled.build.debug_port=
extelec_rc2040picodebug.menu.dbgport.Serial=Serial
extelec_rc2040picodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
extelec_rc2040picodebug.menu.dbgport.Serial1=Serial1
extelec_rc2040picodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
extelec_rc2040picodebug.menu.dbgport.Serial2=Serial2
extelec_rc2040picodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
extelec_rc2040picodebug.menu.dbglvl.None=None
extelec_rc2040picodebug.menu.dbglvl.None.build.debug_level=
extelec_rc2040picodebug.menu.dbglvl.Core=Core
extelec_rc2040picodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
extelec_rc2040picodebug.menu.dbglvl.SPI=SPI
extelec_rc2040picodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
extelec_rc2040picodebug.menu.dbglvl.Wire=Wire
extelec_rc2040picodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
extelec_rc2040picodebug.menu.dbglvl.All=All
extelec_rc2040picodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
extelec_rc2040picodebug.menu.dbglvl.NDEBUG=NDEBUG
extelec_rc2040picodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
extelec_rc2040picodebug.menu.usbstack.nousb=No USB
extelec_rc2040picodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
extelec_rc2040picodebug.menu.ipstack.ipv4only=IPv4 Only
extelec_rc2040picodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
extelec_rc2040picodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
extelec_rc2040picodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
extelec_rc2040picodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
extelec_rc2040picodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

