earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Melopero Cookie RP2040 (Picoprobe)
# -----------------------------------
melopero_cookie_rp2040picoprobe.name=Melopero Cookie RP2040 (Picoprobe)
melopero_cookie_rp2040picoprobe.vid.0=0x2e8a
melopero_cookie_rp2040picoprobe.pid.0=0x0004
melopero_cookie_rp2040picoprobe.vid.1=0x2e8a
melopero_cookie_rp2040picoprobe.pid.1=0x0104
melopero_cookie_rp2040picoprobe.vid.2=0x2e8a
melopero_cookie_rp2040picoprobe.pid.2=0x4004
melopero_cookie_rp2040picoprobe.vid.3=0x2e8a
melopero_cookie_rp2040picoprobe.pid.3=0x4104
melopero_cookie_rp2040picoprobe.vid.4=0x2e8a
melopero_cookie_rp2040picoprobe.pid.4=0x8004
melopero_cookie_rp2040picoprobe.vid.5=0x2e8a
melopero_cookie_rp2040picoprobe.pid.5=0x8104
melopero_cookie_rp2040picoprobe.vid.6=0x2e8a
melopero_cookie_rp2040picoprobe.pid.6=0xc004
melopero_cookie_rp2040picoprobe.vid.7=0x2e8a
melopero_cookie_rp2040picoprobe.pid.7=0xc104
melopero_cookie_rp2040picoprobe.build.usbpid=-DSERIALUSB_PID=0x1011
melopero_cookie_rp2040picoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
melopero_cookie_rp2040picoprobe.build.board=MELOPERO_COOKIE_RP2040
melopero_cookie_rp2040picoprobe.build.mcu=cortex-m0plus
melopero_cookie_rp2040picoprobe.build.variant=melopero_cookie_rp2040
melopero_cookie_rp2040picoprobe.upload.tool=picoprobe
melopero_cookie_rp2040picoprobe.upload.tool.default=picoprobe
melopero_cookie_rp2040picoprobe.upload.maximum_size=8388608
melopero_cookie_rp2040picoprobe.upload.maximum_data_size=262144
melopero_cookie_rp2040picoprobe.upload.wait_for_upload_port=true
melopero_cookie_rp2040picoprobe.upload.erase_cmd=
melopero_cookie_rp2040picoprobe.serial.disableDTR=false
melopero_cookie_rp2040picoprobe.serial.disableRTS=false
melopero_cookie_rp2040picoprobe.build.f_cpu=125000000
melopero_cookie_rp2040picoprobe.build.led=
melopero_cookie_rp2040picoprobe.build.core=rp2040
melopero_cookie_rp2040picoprobe.build.ldscript=memmap_default.ld
melopero_cookie_rp2040picoprobe.build.ram_length=256k
melopero_cookie_rp2040picoprobe.build.debugscript=picoprobe.tcl
melopero_cookie_rp2040picoprobe.build.boot2=boot2_w25q080_2_padded_checksum
melopero_cookie_rp2040picoprobe.build.vid=0x2e8a
melopero_cookie_rp2040picoprobe.build.pid=0x1011
melopero_cookie_rp2040picoprobe.build.usb_manufacturer="Melopero"
melopero_cookie_rp2040picoprobe.build.usb_product="Cookie RP2040 (Picoprobe)"
melopero_cookie_rp2040picoprobe.menu.flash.8388608_0=8MB (no FS)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
melopero_cookie_rp2040picoprobe.menu.flash.8388608_0.build.flash_length=8384512
melopero_cookie_rp2040picoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_0.build.fs_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_0.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_65536.upload.maximum_size=8318976
melopero_cookie_rp2040picoprobe.menu.flash.8388608_65536.build.flash_length=8318976
melopero_cookie_rp2040picoprobe.menu.flash.8388608_65536.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_65536.build.fs_start=276754432
melopero_cookie_rp2040picoprobe.menu.flash.8388608_65536.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_131072.upload.maximum_size=8253440
melopero_cookie_rp2040picoprobe.menu.flash.8388608_131072.build.flash_length=8253440
melopero_cookie_rp2040picoprobe.menu.flash.8388608_131072.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_131072.build.fs_start=276688896
melopero_cookie_rp2040picoprobe.menu.flash.8388608_131072.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_262144.upload.maximum_size=8122368
melopero_cookie_rp2040picoprobe.menu.flash.8388608_262144.build.flash_length=8122368
melopero_cookie_rp2040picoprobe.menu.flash.8388608_262144.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_262144.build.fs_start=276557824
melopero_cookie_rp2040picoprobe.menu.flash.8388608_262144.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_524288.upload.maximum_size=7860224
melopero_cookie_rp2040picoprobe.menu.flash.8388608_524288.build.flash_length=7860224
melopero_cookie_rp2040picoprobe.menu.flash.8388608_524288.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_524288.build.fs_start=276295680
melopero_cookie_rp2040picoprobe.menu.flash.8388608_524288.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_1048576.upload.maximum_size=7335936
melopero_cookie_rp2040picoprobe.menu.flash.8388608_1048576.build.flash_length=7335936
melopero_cookie_rp2040picoprobe.menu.flash.8388608_1048576.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_1048576.build.fs_start=275771392
melopero_cookie_rp2040picoprobe.menu.flash.8388608_1048576.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_2097152.upload.maximum_size=6287360
melopero_cookie_rp2040picoprobe.menu.flash.8388608_2097152.build.flash_length=6287360
melopero_cookie_rp2040picoprobe.menu.flash.8388608_2097152.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_2097152.build.fs_start=274722816
melopero_cookie_rp2040picoprobe.menu.flash.8388608_2097152.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_3145728.upload.maximum_size=5238784
melopero_cookie_rp2040picoprobe.menu.flash.8388608_3145728.build.flash_length=5238784
melopero_cookie_rp2040picoprobe.menu.flash.8388608_3145728.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_3145728.build.fs_start=273674240
melopero_cookie_rp2040picoprobe.menu.flash.8388608_3145728.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
melopero_cookie_rp2040picoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
melopero_cookie_rp2040picoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
melopero_cookie_rp2040picoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_5242880.upload.maximum_size=3141632
melopero_cookie_rp2040picoprobe.menu.flash.8388608_5242880.build.flash_length=3141632
melopero_cookie_rp2040picoprobe.menu.flash.8388608_5242880.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_5242880.build.fs_start=271577088
melopero_cookie_rp2040picoprobe.menu.flash.8388608_5242880.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_6291456.upload.maximum_size=2093056
melopero_cookie_rp2040picoprobe.menu.flash.8388608_6291456.build.flash_length=2093056
melopero_cookie_rp2040picoprobe.menu.flash.8388608_6291456.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_6291456.build.fs_start=270528512
melopero_cookie_rp2040picoprobe.menu.flash.8388608_6291456.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
melopero_cookie_rp2040picoprobe.menu.flash.8388608_7340032.upload.maximum_size=1044480
melopero_cookie_rp2040picoprobe.menu.flash.8388608_7340032.build.flash_length=1044480
melopero_cookie_rp2040picoprobe.menu.flash.8388608_7340032.build.eeprom_start=276819968
melopero_cookie_rp2040picoprobe.menu.flash.8388608_7340032.build.fs_start=269479936
melopero_cookie_rp2040picoprobe.menu.flash.8388608_7340032.build.fs_end=276819968
melopero_cookie_rp2040picoprobe.menu.freq.133=133 MHz
melopero_cookie_rp2040picoprobe.menu.freq.133.build.f_cpu=133000000L
melopero_cookie_rp2040picoprobe.menu.freq.50=50 MHz
melopero_cookie_rp2040picoprobe.menu.freq.50.build.f_cpu=50000000L
melopero_cookie_rp2040picoprobe.menu.freq.100=100 MHz
melopero_cookie_rp2040picoprobe.menu.freq.100.build.f_cpu=100000000L
melopero_cookie_rp2040picoprobe.menu.freq.120=120 MHz
melopero_cookie_rp2040picoprobe.menu.freq.120.build.f_cpu=120000000L
melopero_cookie_rp2040picoprobe.menu.freq.125=125 MHz
melopero_cookie_rp2040picoprobe.menu.freq.125.build.f_cpu=125000000L
melopero_cookie_rp2040picoprobe.menu.freq.150=150 MHz (Overclock)
melopero_cookie_rp2040picoprobe.menu.freq.150.build.f_cpu=150000000L
melopero_cookie_rp2040picoprobe.menu.freq.175=175 MHz (Overclock)
melopero_cookie_rp2040picoprobe.menu.freq.175.build.f_cpu=175000000L
melopero_cookie_rp2040picoprobe.menu.freq.200=200 MHz (Overclock)
melopero_cookie_rp2040picoprobe.menu.freq.200.build.f_cpu=200000000L
melopero_cookie_rp2040picoprobe.menu.freq.225=225 MHz (Overclock)
melopero_cookie_rp2040picoprobe.menu.freq.225.build.f_cpu=225000000L
melopero_cookie_rp2040picoprobe.menu.freq.240=240 MHz (Overclock)
melopero_cookie_rp2040picoprobe.menu.freq.240.build.f_cpu=240000000L
melopero_cookie_rp2040picoprobe.menu.freq.250=250 MHz (Overclock)
melopero_cookie_rp2040picoprobe.menu.freq.250.build.f_cpu=250000000L
melopero_cookie_rp2040picoprobe.menu.freq.275=275 MHz (Overclock)
melopero_cookie_rp2040picoprobe.menu.freq.275.build.f_cpu=275000000L
melopero_cookie_rp2040picoprobe.menu.freq.300=300 MHz (Overclock)
melopero_cookie_rp2040picoprobe.menu.freq.300.build.f_cpu=300000000L
melopero_cookie_rp2040picoprobe.menu.opt.Small=Small (-Os) (standard)
melopero_cookie_rp2040picoprobe.menu.opt.Small.build.flags.optimize=-Os
melopero_cookie_rp2040picoprobe.menu.opt.Optimize=Optimize (-O)
melopero_cookie_rp2040picoprobe.menu.opt.Optimize.build.flags.optimize=-O
melopero_cookie_rp2040picoprobe.menu.opt.Optimize2=Optimize More (-O2)
melopero_cookie_rp2040picoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
melopero_cookie_rp2040picoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
melopero_cookie_rp2040picoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
melopero_cookie_rp2040picoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
melopero_cookie_rp2040picoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
melopero_cookie_rp2040picoprobe.menu.opt.Debug=Debug (-Og)
melopero_cookie_rp2040picoprobe.menu.opt.Debug.build.flags.optimize=-Og
melopero_cookie_rp2040picoprobe.menu.rtti.Disabled=Disabled
melopero_cookie_rp2040picoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
melopero_cookie_rp2040picoprobe.menu.rtti.Enabled=Enabled
melopero_cookie_rp2040picoprobe.menu.rtti.Enabled.build.flags.rtti=
melopero_cookie_rp2040picoprobe.menu.stackprotect.Disabled=Disabled
melopero_cookie_rp2040picoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
melopero_cookie_rp2040picoprobe.menu.stackprotect.Enabled=Enabled
melopero_cookie_rp2040picoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
melopero_cookie_rp2040picoprobe.menu.exceptions.Disabled=Disabled
melopero_cookie_rp2040picoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
melopero_cookie_rp2040picoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
melopero_cookie_rp2040picoprobe.menu.exceptions.Enabled=Enabled
melopero_cookie_rp2040picoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
melopero_cookie_rp2040picoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
melopero_cookie_rp2040picoprobe.menu.dbgport.Disabled=Disabled
melopero_cookie_rp2040picoprobe.menu.dbgport.Disabled.build.debug_port=
melopero_cookie_rp2040picoprobe.menu.dbgport.Serial=Serial
melopero_cookie_rp2040picoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
melopero_cookie_rp2040picoprobe.menu.dbgport.Serial1=Serial1
melopero_cookie_rp2040picoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
melopero_cookie_rp2040picoprobe.menu.dbgport.Serial2=Serial2
melopero_cookie_rp2040picoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
melopero_cookie_rp2040picoprobe.menu.dbglvl.None=None
melopero_cookie_rp2040picoprobe.menu.dbglvl.None.build.debug_level=
melopero_cookie_rp2040picoprobe.menu.dbglvl.Core=Core
melopero_cookie_rp2040picoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
melopero_cookie_rp2040picoprobe.menu.dbglvl.SPI=SPI
melopero_cookie_rp2040picoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
melopero_cookie_rp2040picoprobe.menu.dbglvl.Wire=Wire
melopero_cookie_rp2040picoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
melopero_cookie_rp2040picoprobe.menu.dbglvl.All=All
melopero_cookie_rp2040picoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
melopero_cookie_rp2040picoprobe.menu.dbglvl.NDEBUG=NDEBUG
melopero_cookie_rp2040picoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
melopero_cookie_rp2040picoprobe.menu.usbstack.picosdk=Pico SDK
melopero_cookie_rp2040picoprobe.menu.usbstack.picosdk.build.usbstack_flags=
melopero_cookie_rp2040picoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
melopero_cookie_rp2040picoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
melopero_cookie_rp2040picoprobe.menu.usbstack.nousb=No USB
melopero_cookie_rp2040picoprobe.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
melopero_cookie_rp2040picoprobe.menu.ipstack.ipv4only=IPv4 Only
melopero_cookie_rp2040picoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
melopero_cookie_rp2040picoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
melopero_cookie_rp2040picoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
melopero_cookie_rp2040picoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
melopero_cookie_rp2040picoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

